artillery/artillery.yaml
config:
  target: "https://x9dhnr5yy7.execute-api.ap-northeast-2.amazonaws.com"
  phases:
    - duration: 20
      arrivalRate: 1
    - duration: 30
      arrivalRate: 1
  defaults:
    headers:
      content-type: application/json

scenarios:
  - name: Book Bus
    flow:
      - post:
          url: "/api/book-bus"
          json:
            userId: "u-{{ $randomNumber(1,1000000) }}"
            route: "서울→부산"
            date: "2025-08-25"
            passengers: 1